# Filter with More than One Condition (OR)

In [3]:
import pandas as pd
employees = pd.read_csv('employees.csv', parse_dates=['Start Date', 'Last Login Time'])
employees['Senior Management'] = employees['Senior Management'].astype('bool')
employees['Gender'] = employees['Gender'].astype('category')
employees.head(n=2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-07-12 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-07-12 06:53:00,61933,4.170,True,NaN

In [8]:
mask_seniorManagement = employees['Senior Management']

In [7]:
mask_startDate = employees['Start Date'] < '1990-01-01'

In [10]:
employees[mask_seniorManagement | mask_startDate].head(n=2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-07-12 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-07-12 06:53:00,61933,4.170,True,NaN

In [11]:
mask_firstName = employees['First Name'] == 'Robert'

In [12]:
mask_team = employees['Team'] == 'Client Services'

In [17]:
mask_time = employees['Start Date'] > '2016-06-01'

In [19]:
employees[(mask_firstName & mask_team) | mask_time].head(n=2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2022-07-12 06:09:00,59414,1.256,False,Product
98,Tina,Female,2016-06-16,2022-07-12 19:47:00,100705,16.961,True,Marketing